# Programming and Data Analysis

> Data Wrangling with Pandas

Yao-Jen Kuo <yaojenkuo@ntu.edu.tw> from [DATAINPOINT](https://www.datainpoint.com/)

In [1]:
import pandas as pd

## Data Wrangling

## The definition of modern data science

> Modern data science is a huge field, it invovles applications and tools like importing, tidying, transformation, visualization, modeling, and communication. Surrounding all these is programming.

![Imgur](https://i.imgur.com/din6Ig6.png)

Source: [R for Data Science](https://r4ds.had.co.nz/)

## Key functionalities analysts rely on `pandas` are

- Importing
- Tidying
- Transforming

## Tidying and transforming together is also known as WRANGLING

![](https://media.giphy.com/media/MnlZWRFHR4xruE4N2Z/giphy.gif)

Source: <https://giphy.com>

## Importing

## `pandas` has massive functions importing tabular data

- Flat text file
- Database table
- Spreadsheet
- HTML `<table></table>` tags
- ...etc.

Source: <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>

## Use a pre-built environment to import files in data folder

[classroom-programming-and-data-analysis-2023/data](https://mybinder.org/v2/gh/datainpoint/classroom-programming-and-data-analysis-2023/HEAD?labpath=data)

## Using `read_csv()` function for csv files

```python
csv_file_path = "PATH/TO/YOUR/CSV/FILE"
pd.read_csv(csv_file_path)
```

## Using `read_sql()` function for database tables

```python
import sqlite3

conn = sqlite3.connect('YOUR_DATABASE.db')
sql_query = """
SELECT * 
  FROM YOUR_TABLE;
"""
pd.read_sql(sql_query, conn)
```

## Using `read_excel()` function for spreadsheets

```python
excel_file_path = "PATH/TO/YOUR/EXCEL/FILE"
pd.read_excel(excel_file_path)
```

## Basic attributes and methods

## Basic attributes of a `DataFrame` object

- `shape`
- `dtypes`
- `index`
- `columns`

In [2]:
daily_report = pd.read_csv("https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master\
/csse_covid_19_data/csse_covid_19_daily_reports/03-09-2023.csv")
print(daily_report.shape)
print(daily_report.dtypes)
print(daily_report.index)
print(daily_report.columns)

(4016, 14)
FIPS                   float64
Admin2                  object
Province_State          object
Country_Region          object
Last_Update             object
Lat                    float64
Long_                  float64
Confirmed                int64
Deaths                   int64
Recovered              float64
Active                 float64
Combined_Key            object
Incident_Rate          float64
Case_Fatality_Ratio    float64
dtype: object
RangeIndex(start=0, stop=4016, step=1)
Index(['FIPS', 'Admin2', 'Province_State', 'Country_Region', 'Last_Update',
       'Lat', 'Long_', 'Confirmed', 'Deaths', 'Recovered', 'Active',
       'Combined_Key', 'Incident_Rate', 'Case_Fatality_Ratio'],
      dtype='object')

## Basic methods of a `DataFrame` object

- `head(n)`
- `tail(n)`
- `describe()`
- `info()`
- `set_index()`
- `reset_index()`

## `head(n)` returns the top n observations with header

In [3]:
daily_report.head() # n is default to 5

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
0,NaN,NaN,NaN,Afghanistan,2023-03-10 04:21:03,33.93911,67.709953,209451,7896,NaN,NaN,Afghanistan,538.042451,3.769855
1,NaN,NaN,NaN,Albania,2023-03-10 04:21:03,41.15330,20.168300,334457,3598,NaN,NaN,Albania,11621.968170,1.075774
2,NaN,NaN,NaN,Algeria,2023-03-10 04:21:03,28.03390,1.659600,271496,6881,NaN,NaN,Algeria,619.132366,2.534476
3,NaN,NaN,NaN,Andorra,2023-03-10 04:21:03,42.50630,1.521800,47890,165,NaN,NaN,Andorra,61981.492267,0.344540
4,NaN,NaN,NaN,Angola,2023-03-10 04:21:03,-11.20270,17.873900,105288,1933,NaN,NaN,Angola,320.352770,1.835917

## `tail(n)` returns the bottom n observations with header

In [4]:
daily_report.tail(3)

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
4013,NaN,NaN,NaN,Yemen,2023-03-10 04:21:03,15.552727,48.516388,11945,2159,NaN,NaN,Yemen,40.048994,18.074508
4014,NaN,NaN,NaN,Zambia,2023-03-10 04:21:03,-13.133897,27.849332,343135,4057,NaN,NaN,Zambia,1866.491630,1.182333
4015,NaN,NaN,NaN,Zimbabwe,2023-03-10 04:21:03,-19.015438,29.154857,264276,5671,NaN,NaN,Zimbabwe,1778.088529,2.145863

## `describe()` returns the descriptive summary for numeric columns

In [5]:
daily_report.describe()

,FIPS,Lat,Long_,Confirmed,Deaths,Recovered,Active,Incident_Rate,Case_Fatality_Ratio
count,3268.000000,3925.000000,3925.000000,4.016000e+03,4016.000000,0.0,0.0,3922.000000,3974.000000
mean,32405.943390,35.736183,-71.109728,1.684687e+05,1713.596614,NaN,NaN,28539.052104,3.872085
std,18056.381177,13.441327,55.361480,1.067218e+06,8865.157745,NaN,NaN,10774.908530,124.151911
min,60.000000,-71.949900,-178.116500,0.000000e+00,0.000000,NaN,NaN,0.000000,0.000000
25%,19048.500000,33.191535,-96.595639,3.836250e+03,48.000000,NaN,NaN,24159.998451,0.893031
50%,30068.000000,37.895700,-86.717326,1.081150e+04,135.000000,NaN,NaN,29528.828111,1.283812
75%,47041.500000,42.176955,-77.357900,4.684225e+04,481.250000,NaN,NaN,34185.676602,1.731697
max,99999.000000,71.706900,178.065000,3.861851e+07,186138.000000,NaN,NaN,238461.538462,7674.242424

## `info()` returns the concise information of the dataframe

In [6]:
daily_report.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4016 entries, 0 to 4015
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   FIPS                 3268 non-null   float64
 1   Admin2               3272 non-null   object
 2   Province_State       3837 non-null   object
 3   Country_Region       4016 non-null   object
 4   Last_Update          4016 non-null   object
 5   Lat                  3925 non-null   float64
 6   Long_                3925 non-null   float64
 7   Confirmed            4016 non-null   int64
 8   Deaths               4016 non-null   int64
 9   Recovered            0 non-null      float64
 10  Active               0 non-null      float64
 11  Combined_Key         4016 non-null   object
 12  Incident_Rate        3922 non-null   float64
 13  Case_Fatality_Ratio  3974 non-null   float64
dtypes: float64(7), int64(2), object(5)
memory usage: 439.4+ KB

## `set_index()` replaces current `Index` with a specific variable

In [7]:
daily_report.set_index('Combined_Key')

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Incident_Rate,Case_Fatality_Ratio
Combined_Key,,,,,,,,,,,,,
Afghanistan,NaN,NaN,NaN,Afghanistan,2023-03-10 04:21:03,33.939110,67.709953,209451,7896,NaN,NaN,538.042451,3.769855
Albania,NaN,NaN,NaN,Albania,2023-03-10 04:21:03,41.153300,20.168300,334457,3598,NaN,NaN,11621.968170,1.075774
Algeria,NaN,NaN,NaN,Algeria,2023-03-10 04:21:03,28.033900,1.659600,271496,6881,NaN,NaN,619.132366,2.534476
Andorra,NaN,NaN,NaN,Andorra,2023-03-10 04:21:03,42.506300,1.521800,47890,165,NaN,NaN,61981.492267,0.344540
Angola,NaN,NaN,NaN,Angola,2023-03-10 04:21:03,-11.202700,17.873900,105288,1933,NaN,NaN,320.352770,1.835917
...,...,...,...,...,...,...,...,...,...,...,...,...,...
West Bank and Gaza,NaN,NaN,NaN,West Bank and Gaza,2023-03-10 04:21:03,31.952200,35.233200,703228,5708,NaN,NaN,13784.956961,0.811686
Winter Olympics 2022,NaN,NaN,NaN,Winter Olympics 2022,2023-03-10 04:21:03,39.904200,116.407400,535,0,NaN,NaN,NaN,0.000000
Yemen,NaN,NaN,NaN,Yemen,2023-03-10 04:21:03,15.552727,48.516388,11945,2159,NaN,NaN,40.048994,18.074508
Zambia,NaN,NaN,NaN,Zambia,2023-03-10 04:21:03,-13.133897,27.849332,343135,4057,NaN,NaN,1866.491630,1.182333
Zimbabwe,NaN,NaN,NaN,Zimbabwe,2023-03-10 04:21:03,-19.015438,29.154857,264276,5671,NaN,NaN,1778.088529,2.145863

## `reset_index()` resets current `Index` with default `RangeIndex`

In [8]:
daily_report.set_index('Combined_Key').reset_index()

,Combined_Key,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Incident_Rate,Case_Fatality_Ratio
0,Afghanistan,NaN,NaN,NaN,Afghanistan,2023-03-10 04:21:03,33.939110,67.709953,209451,7896,NaN,NaN,538.042451,3.769855
1,Albania,NaN,NaN,NaN,Albania,2023-03-10 04:21:03,41.153300,20.168300,334457,3598,NaN,NaN,11621.968170,1.075774
2,Algeria,NaN,NaN,NaN,Algeria,2023-03-10 04:21:03,28.033900,1.659600,271496,6881,NaN,NaN,619.132366,2.534476
3,Andorra,NaN,NaN,NaN,Andorra,2023-03-10 04:21:03,42.506300,1.521800,47890,165,NaN,NaN,61981.492267,0.344540
4,Angola,NaN,NaN,NaN,Angola,2023-03-10 04:21:03,-11.202700,17.873900,105288,1933,NaN,NaN,320.352770,1.835917
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4011,West Bank and Gaza,NaN,NaN,NaN,West Bank and Gaza,2023-03-10 04:21:03,31.952200,35.233200,703228,5708,NaN,NaN,13784.956961,0.811686
4012,Winter Olympics 2022,NaN,NaN,NaN,Winter Olympics 2022,2023-03-10 04:21:03,39.904200,116.407400,535,0,NaN,NaN,NaN,0.000000
4013,Yemen,NaN,NaN,NaN,Yemen,2023-03-10 04:21:03,15.552727,48.516388,11945,2159,NaN,NaN,40.048994,18.074508
4014,Zambia,NaN,NaN,NaN,Zambia,2023-03-10 04:21:03,-13.133897,27.849332,343135,4057,NaN,NaN,1866.491630,1.182333
4015,Zimbabwe,NaN,NaN,NaN,Zimbabwe,2023-03-10 04:21:03,-19.015438,29.154857,264276,5671,NaN,NaN,1778.088529,2.145863

## Basic Wrangling

## Basic wrangling is like writing SQL queries

- Selecting: `SELECT FROM`
- Filtering: `WHERE`
- Subset: `SELECT FROM WHERE`

## Basic wrangling is like writing SQL queries(cont'd)

- Indexing
- Sorting: `ORDER BY`
- Deriving
- Summarizing
- Summarizing and Grouping: `GROUP BY`

## Selecting a column as `Series`

In [9]:
print(daily_report['Country_Region'])
print(type(daily_report['Country_Region']))

0                Afghanistan
1                    Albania
2                    Algeria
3                    Andorra
4                     Angola
                ...
4011      West Bank and Gaza
4012    Winter Olympics 2022
4013                   Yemen
4014                  Zambia
4015                Zimbabwe
Name: Country_Region, Length: 4016, dtype: object
<class 'pandas.core.series.Series'>

## Selecting a column as `DataFrame`

In [10]:
print(type(daily_report[['Country_Region']]))
daily_report[['Country_Region']]

<class 'pandas.core.frame.DataFrame'>

            Country_Region
0              Afghanistan
1                  Albania
2                  Algeria
3                  Andorra
4                   Angola
...                    ...
4011    West Bank and Gaza
4012  Winter Olympics 2022
4013                 Yemen
4014                Zambia
4015              Zimbabwe

[4016 rows x 1 columns]

## Selecting multiple columns as `DataFrame`, for sure

In [11]:
cols = ['Country_Region', 'Confirmed', 'Deaths']
daily_report[cols]

            Country_Region  Confirmed  Deaths
0              Afghanistan     209451    7896
1                  Albania     334457    3598
2                  Algeria     271496    6881
3                  Andorra      47890     165
4                   Angola     105288    1933
...                    ...        ...     ...
4011    West Bank and Gaza     703228    5708
4012  Winter Olympics 2022        535       0
4013                 Yemen      11945    2159
4014                Zambia     343135    4057
4015              Zimbabwe     264276    5671

[4016 rows x 3 columns]

## Filtering rows with conditional statements

In [12]:
is_taiwan = daily_report['Country_Region'] == 'Taiwan*'
daily_report[is_taiwan]

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
667,NaN,NaN,NaN,Taiwan*,2023-03-10 04:21:03,23.7,121.0,9970937,17672,NaN,NaN,Taiwan*,41865.185358,0.177235

## Subsetting columns and rows simultaneously

In [13]:
cols_to_select = ['Country_Region', 'Confirmed', 'Deaths']
rows_to_filter = daily_report['Country_Region'] == 'Taiwan*'
daily_report[rows_to_filter][cols_to_select]

    Country_Region  Confirmed  Deaths
667        Taiwan*    9970937   17672

## Indexing `DataFrame` with

- `loc[]`
- `iloc[]`

## `loc[]` is indexing `DataFrame` with `Index`

In [14]:
taiwan_row_index = daily_report[is_taiwan].index[0]
print(daily_report.loc[taiwan_row_index, ['Country_Region', 'Confirmed']]) # as Series
daily_report.loc[[taiwan_row_index], ['Country_Region', 'Confirmed']] # as DataFrame

Country_Region    Taiwan*
Confirmed         9970937
Name: 667, dtype: object

    Country_Region  Confirmed
667        Taiwan*    9970937

## `iloc[]` is indexing `DataFrame` with absolute position

In [15]:
print(daily_report.iloc[taiwan_row_index, [3, 7]]) # as Series
daily_report.iloc[[taiwan_row_index], [3, 7]] # as DataFrame

Country_Region    Taiwan*
Confirmed         9970937
Name: 667, dtype: object

    Country_Region  Confirmed
667        Taiwan*    9970937

## Sorting `DataFrame` with

- `sort_values`
- `sort_index`

## `sort_values` sorts `DataFrame` with specific columns

In [16]:
daily_report.sort_values(['Country_Region', 'Confirmed'])

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
0,NaN,NaN,NaN,Afghanistan,2023-03-10 04:21:03,33.939110,67.709953,209451,7896,NaN,NaN,Afghanistan,538.042451,3.769855
1,NaN,NaN,NaN,Albania,2023-03-10 04:21:03,41.153300,20.168300,334457,3598,NaN,NaN,Albania,11621.968170,1.075774
2,NaN,NaN,NaN,Algeria,2023-03-10 04:21:03,28.033900,1.659600,271496,6881,NaN,NaN,Algeria,619.132366,2.534476
3,NaN,NaN,NaN,Andorra,2023-03-10 04:21:03,42.506300,1.521800,47890,165,NaN,NaN,Andorra,61981.492267,0.344540
4,NaN,NaN,NaN,Angola,2023-03-10 04:21:03,-11.202700,17.873900,105288,1933,NaN,NaN,Angola,320.352770,1.835917
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4011,NaN,NaN,NaN,West Bank and Gaza,2023-03-10 04:21:03,31.952200,35.233200,703228,5708,NaN,NaN,West Bank and Gaza,13784.956961,0.811686
4012,NaN,NaN,NaN,Winter Olympics 2022,2023-03-10 04:21:03,39.904200,116.407400,535,0,NaN,NaN,Winter Olympics 2022,NaN,0.000000
4013,NaN,NaN,NaN,Yemen,2023-03-10 04:21:03,15.552727,48.516388,11945,2159,NaN,NaN,Yemen,40.048994,18.074508
4014,NaN,NaN,NaN,Zambia,2023-03-10 04:21:03,-13.133897,27.849332,343135,4057,NaN,NaN,Zambia,1866.491630,1.182333
4015,NaN,NaN,NaN,Zimbabwe,2023-03-10 04:21:03,-19.015438,29.154857,264276,5671,NaN,NaN,Zimbabwe,1778.088529,2.145863

## `sort_index` sorts `DataFrame` with the `Index` of `DataFrame`

In [17]:
daily_report.sort_index(ascending=False)

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
4015,NaN,NaN,NaN,Zimbabwe,2023-03-10 04:21:03,-19.015438,29.154857,264276,5671,NaN,NaN,Zimbabwe,1778.088529,2.145863
4014,NaN,NaN,NaN,Zambia,2023-03-10 04:21:03,-13.133897,27.849332,343135,4057,NaN,NaN,Zambia,1866.491630,1.182333
4013,NaN,NaN,NaN,Yemen,2023-03-10 04:21:03,15.552727,48.516388,11945,2159,NaN,NaN,Yemen,40.048994,18.074508
4012,NaN,NaN,NaN,Winter Olympics 2022,2023-03-10 04:21:03,39.904200,116.407400,535,0,NaN,NaN,Winter Olympics 2022,NaN,0.000000
4011,NaN,NaN,NaN,West Bank and Gaza,2023-03-10 04:21:03,31.952200,35.233200,703228,5708,NaN,NaN,West Bank and Gaza,13784.956961,0.811686
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,NaN,NaN,NaN,Angola,2023-03-10 04:21:03,-11.202700,17.873900,105288,1933,NaN,NaN,Angola,320.352770,1.835917
3,NaN,NaN,NaN,Andorra,2023-03-10 04:21:03,42.506300,1.521800,47890,165,NaN,NaN,Andorra,61981.492267,0.344540
2,NaN,NaN,NaN,Algeria,2023-03-10 04:21:03,28.033900,1.659600,271496,6881,NaN,NaN,Algeria,619.132366,2.534476
1,NaN,NaN,NaN,Albania,2023-03-10 04:21:03,41.153300,20.168300,334457,3598,NaN,NaN,Albania,11621.968170,1.075774
0,NaN,NaN,NaN,Afghanistan,2023-03-10 04:21:03,33.939110,67.709953,209451,7896,NaN,NaN,Afghanistan,538.042451,3.769855

## Deriving new variables from `DataFrame`

- Simple operations
- `map` with a `dict`
- `map` with a function(or a lambda expression)

## Deriving new variable with simple operations

In [18]:
case_fatality_ratio = daily_report['Deaths'] / daily_report['Confirmed']
case_fatality_ratio

0       0.037699
1       0.010758
2       0.025345
3       0.003445
4       0.018359
          ...
4011    0.008117
4012    0.000000
4013    0.180745
4014    0.011823
4015    0.021459
Length: 4016, dtype: float64

## Deriving categorical from categorical with `map`

- Passing a `dict`
- Passing a function(or lambda expression)

In [19]:
# Passing a dict
country_name = {
    'Taiwan*': 'Taiwan'
}
daily_report_tw = daily_report[is_taiwan]
daily_report_tw['Country_Region'].map(country_name)

667    Taiwan
Name: Country_Region, dtype: object

In [20]:
# Passing a function
def replace_asterisk(x):
    if "*" in x:
        return x.replace("*", "")
    else:
        return x

daily_report['Country_Region'].map(replace_asterisk)[taiwan_row_index]

'Taiwan'

In [21]:
# Passing a lambda expression)
daily_report['Country_Region'].map(lambda x: x.replace("*", "") if "*" in x else x)[taiwan_row_index]

'Taiwan'

## Summarizing `DataFrame` with aggregate methods

In [22]:
daily_report['Confirmed'].sum()

676570149

## Summarizing and grouping `DataFrame` with aggregate methods

In [23]:
daily_report.groupby('Country_Region')['Confirmed'].sum()

Country_Region
Afghanistan             209451
Albania                 334457
Algeria                 271496
Andorra                  47890
Angola                  105288
                         ...
West Bank and Gaza      703228
Winter Olympics 2022       535
Yemen                    11945
Zambia                  343135
Zimbabwe                264276
Name: Confirmed, Length: 201, dtype: int64

## Advanced Wrangling

## Other common wranglings including

- Dealing with missing values.
- Dealing with text values.
- Reshaping dataframes.
- Concatenating, merging and joining dataframes.

## Dealing with missing values

- Using `isnull` or `notnull` to check if `np.nan` exists.
- Using `dropna` to drop rows with `np.nan`.
- Using `fillna` to fill `np.nan` with specific values.

In [24]:
print(daily_report['Province_State'].size)
print(daily_report['Province_State'].isnull().sum())
print(daily_report['Province_State'].notnull().sum())

4016
179
3837

In [25]:
print(daily_report.dropna().shape)
print(daily_report['FIPS'].fillna(0))

(0, 14)
0       0.0
1       0.0
2       0.0
3       0.0
4       0.0
       ...
4011    0.0
4012    0.0
4013    0.0
4014    0.0
4015    0.0
Name: FIPS, Length: 4016, dtype: float64

## Summarizing text columns

- `unique`
- `nunique`
- `value_counts`

In [26]:
print(daily_report['Country_Region'].nunique())
print(daily_report['Country_Region'].unique())

201
['Afghanistan' 'Albania' 'Algeria' 'Andorra' 'Angola' 'Antarctica'
 'Antigua and Barbuda' 'Argentina' 'Armenia' 'Australia' 'Austria'
 'Azerbaijan' 'Bahamas' 'Bahrain' 'Bangladesh' 'Barbados' 'Belarus'
 'Belgium' 'Belize' 'Benin' 'Bhutan' 'Bolivia' 'Bosnia and Herzegovina'
 'Botswana' 'Brazil' 'Brunei' 'Bulgaria' 'Burkina Faso' 'Burma' 'Burundi'
 'Cabo Verde' 'Cambodia' 'Cameroon' 'Canada' 'Central African Republic'
 'Chad' 'Chile' 'China' 'Colombia' 'Comoros' 'Congo (Brazzaville)'
 'Congo (Kinshasa)' 'Costa Rica' "Cote d'Ivoire" 'Croatia' 'Cuba' 'Cyprus'
 'Czechia' 'Denmark' 'Diamond Princess' 'Djibouti' 'Dominica'
 'Dominican Republic' 'Ecuador' 'Egypt' 'El Salvador' 'Equatorial Guinea'
 'Eritrea' 'Estonia' 'Eswatini' 'Ethiopia' 'Fiji' 'Finland' 'France'
 'Gabon' 'Gambia' 'Georgia' 'Germany' 'Ghana' 'Greece' 'Grenada'
 'Guatemala' 'Guinea' 'Guinea-Bissau' 'Guyana' 'Haiti' 'Holy See'
 'Honduras' 'Hungary' 'Iceland' 'India' 'Indonesia' 'Iran' 'Iraq'
 'Ireland' 'Israel' 'Italy' 'Jamaica' 'Japan' 'Jordan' 'Kazakhstan'
 'Kenya' 'Kiribati' 'Korea, North' 'Korea, South' 'Kosovo' 'Kuwait'
 'Kyrgyzstan' 'Laos' 'Latvia' 'Lebanon' 'Lesotho' 'Liberia' 'Libya'
 'Liechtenstein' 'Lithuania' 'Luxembourg' 'MS Zaandam' 'Madagascar'
 'Malawi' 'Malaysia' 'Maldives' 'Mali' 'Malta' 'Marshall Islands'
 'Mauritania' 'Mauritius' 'Mexico' 'Micronesia' 'Moldova' 'Monaco'
 'Mongolia' 'Montenegro' 'Morocco' 'Mozambique' 'Namibia' 'Nauru' 'Nepal'
 'Netherlands' 'New Zealand' 'Nicaragua' 'Niger' 'Nigeria'
 'North Macedonia' 'Norway' 'Oman' 'Pakistan' 'Palau' 'Panama'
 'Papua New Guinea' 'Paraguay' 'Peru' 'Philippines' 'Poland' 'Portugal'
 'Qatar' 'Romania' 'Russia' 'Rwanda' 'Saint Kitts and Nevis' 'Saint Lucia'
 'Saint Vincent and the Grenadines' 'Samoa' 'San Marino'
 'Sao Tome and Principe' 'Saudi Arabia' 'Senegal' 'Serbia' 'Seychelles'
 'Sierra Leone' 'Singapore' 'Slovakia' 'Slovenia' 'Solomon Islands'
 'Somalia' 'South Africa' 'South Sudan' 'Spain' 'Sri Lanka' 'Sudan'
 'Summer Olympics 2020' 'Suriname' 'Sweden' 'Switzerland' 'Syria'
 'Taiwan*' 'Tajikistan' 'Tanzania' 'Thailand' 'Timor-Leste' 'Togo' 'Tonga'
 'Trinidad and Tobago' 'Tunisia' 'Turkey' 'Tuvalu' 'US' 'Uganda' 'Ukraine'
 'United Arab Emirates' 'United Kingdom' 'Uruguay' 'Uzbekistan' 'Vanuatu'
 'Venezuela' 'Vietnam' 'West Bank and Gaza' 'Winter Olympics 2022' 'Yemen'
 'Zambia' 'Zimbabwe']

In [27]:
daily_report['Country_Region'].value_counts()

Country_Region
US          3279
Russia        83
Japan         49
India         37
China         34
            ...
Guyana         1
Haiti          1
Holy See       1
Honduras       1
Zimbabwe       1
Name: count, Length: 201, dtype: int64

## Two formats of a table

- Wide: data is presented with each different data variable in a separate column.
- Long: data is presented with one column containing all the values and another column listing the context of the value.

Source: <https://en.wikipedia.org/wiki/Wide_and_narrow_data>

## Wide, or unstacked data

In [28]:
request_url = "https://en.wikipedia.org/wiki/Wide_and_narrow_data"
wide_format = pd.read_html(request_url)[0]
wide_format

  Person  Age  Weight  Height
0    Bob   32     168     180
1  Alice   24     150     175
2  Steve   64     144     165

## Narrow, stacked, or long data

In [29]:
request_url = "https://en.wikipedia.org/wiki/Wide_and_narrow_data"
long_format = pd.read_html(request_url)[1]
long_format

  Person Variable  Value
0    Bob      Age     32
1    Bob   Weight    168
2    Bob   Height    180
3  Alice      Age     24
4  Alice   Weight    150
5  Alice   Height    175
6  Steve      Age     64
7  Steve   Weight    144
8  Steve   Height    165

## Reshaping dataframes from wide to long format with `pd.melt()`

In [30]:
pd.melt(wide_format, 
        id_vars="Person", value_vars=["Age", "Weight", "Height"],
        var_name="Variable", value_name="Value")

  Person Variable  Value
0    Bob      Age     32
1  Alice      Age     24
2  Steve      Age     64
3    Bob   Weight    168
4  Alice   Weight    150
5  Steve   Weight    144
6    Bob   Height    180
7  Alice   Height    175
8  Steve   Height    165

## Reshaping dataframes from long to wide format with `pivot()`

In [31]:
long_format.pivot(index="Person", columns="Variable", values="Value").reset_index().rename_axis(None, axis=1)

  Person  Age  Height  Weight
0  Alice   24     175     150
1    Bob   32     180     168
2  Steve   64     165     144

## A common problem is that a dataset where some of the column names are not names of variables, but values of a variable

In [32]:
ts_confirmed_global_url = "https://raw.githubusercontent.com/CSSEGISandData\
/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series\
/time_series_covid19_confirmed_global.csv"
ts_confirmed_global = pd.read_csv(ts_confirmed_global_url)
ts_confirmed_global

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,2/28/23,3/1/23,3/2/23,3/3/23,3/4/23,3/5/23,3/6/23,3/7/23,3/8/23,3/9/23
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,209322,209340,209358,209362,209369,209390,209406,209436,209451,209451
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,334391,334408,334408,334427,334427,334427,334427,334427,334443,334457
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,271441,271448,271463,271469,271469,271477,271477,271490,271494,271496
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,47866,47875,47875,47875,47875,47875,47875,47875,47890,47890
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,105255,105277,105277,105277,105277,105277,105277,105277,105288,105288
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
284,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,703228,703228,703228,703228,703228,703228,703228,703228,703228,703228
285,NaN,Winter Olympics 2022,39.904200,116.407400,0,0,0,0,0,0,...,535,535,535,535,535,535,535,535,535,535
286,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,11945,11945,11945,11945,11945,11945,11945,11945,11945,11945
287,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,343012,343012,343079,343079,343079,343135,343135,343135,343135,343135
288,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,263921,264127,264127,264127,264127,264127,264127,264127,264276,264276

## We can pivot the columns into a new pair of variables

To describe that operation we need four parameters:

- The set of columns whose names are not values
- The set of columns whose names are values
- The name of the variable to move the column names to
- The name of the variable to move the column values to

## In this example, the four parameters are

- `id_vars`: `['Province/State', 'Country/Region', 'Lat', 'Long']`
- `value_vars`: The columns from `1/22/20` to the last column
- `var_name`: Let's name it `Date`
- `value_name`: Let's name it `Confirmed`

In [33]:
idVars = ['Province/State', 'Country/Region', 'Lat', 'Long']
ts_confirmed_global_long = pd.melt(ts_confirmed_global,
                                   id_vars=idVars,
                                   var_name='Date',
                                   value_name='Confirmed')
ts_confirmed_global_long

,Province/State,Country/Region,Lat,Long,Date,Confirmed
0,NaN,Afghanistan,33.939110,67.709953,1/22/20,0
1,NaN,Albania,41.153300,20.168300,1/22/20,0
2,NaN,Algeria,28.033900,1.659600,1/22/20,0
3,NaN,Andorra,42.506300,1.521800,1/22/20,0
4,NaN,Angola,-11.202700,17.873900,1/22/20,0
...,...,...,...,...,...,...
330322,NaN,West Bank and Gaza,31.952200,35.233200,3/9/23,703228
330323,NaN,Winter Olympics 2022,39.904200,116.407400,3/9/23,535
330324,NaN,Yemen,15.552727,48.516388,3/9/23,11945
330325,NaN,Zambia,-13.133897,27.849332,3/9/23,343135
330326,NaN,Zimbabwe,-19.015438,29.154857,3/9/23,264276

## Concatenating, merging and joining dataframes

- `concat()` vertically or horizontally.
- `merge()` horizontally on column names.
- `join()` horizontally on index.

In [34]:
movies = pd.read_csv("https://raw.githubusercontent.com/datainpoint/classroom-programming-and-data-analysis-2023/main/data/movies.csv")
batman_trilogy = movies[movies["title"].str.contains("Batman|Dark Knight", regex=True)]
batman_trilogy

,id,title,release_year,runtime,rating,link
2,3,The Dark Knight,2008,152,9.0,https://www.imdb.com//title/tt0468569/
69,70,The Dark Knight Rises,2012,164,8.4,https://www.imdb.com//title/tt1345836/
128,129,Batman Begins,2005,140,8.2,https://www.imdb.com//title/tt0372784/

In [35]:
lord_of_the_rings_trilogy = movies[movies["title"].str.contains("Rings", regex=False)]
lord_of_the_rings_trilogy

,id,title,release_year,runtime,rating,link
6,7,The Lord of the Rings: The Return of the King,2003,201,9.0,https://www.imdb.com//title/tt0167260/
8,9,The Lord of the Rings: The Fellowship of the Ring,2001,178,8.8,https://www.imdb.com//title/tt0120737/
12,13,The Lord of the Rings: The Two Towers,2002,179,8.8,https://www.imdb.com//title/tt0167261/

## Use `concat()` function to concatenate vertically or horizontally

In [36]:
pd.concat((batman_trilogy, lord_of_the_rings_trilogy))

,id,title,release_year,runtime,rating,link
2,3,The Dark Knight,2008,152,9.0,https://www.imdb.com//title/tt0468569/
69,70,The Dark Knight Rises,2012,164,8.4,https://www.imdb.com//title/tt1345836/
128,129,Batman Begins,2005,140,8.2,https://www.imdb.com//title/tt0372784/
6,7,The Lord of the Rings: The Return of the King,2003,201,9.0,https://www.imdb.com//title/tt0167260/
8,9,The Lord of the Rings: The Fellowship of the Ring,2001,178,8.8,https://www.imdb.com//title/tt0120737/
12,13,The Lord of the Rings: The Two Towers,2002,179,8.8,https://www.imdb.com//title/tt0167261/

In [37]:
pd.concat((batman_trilogy["title"], lord_of_the_rings_trilogy["title"]), axis=1)

                     title                                              title
2          The Dark Knight                                                NaN
69   The Dark Knight Rises                                                NaN
128          Batman Begins                                                NaN
6                      NaN      The Lord of the Rings: The Return of the King
8                      NaN  The Lord of the Rings: The Fellowship of the Ring
12                     NaN              The Lord of the Rings: The Two Towers

In [38]:
pd.concat((batman_trilogy["title"].reset_index(drop=True),
           lord_of_the_rings_trilogy["title"].reset_index(drop=True)),
          axis=1)

                   title                                              title
0        The Dark Knight      The Lord of the Rings: The Return of the King
1  The Dark Knight Rises  The Lord of the Rings: The Fellowship of the Ring
2          Batman Begins              The Lord of the Rings: The Two Towers

In [39]:
left_df = movies.loc[:9, ['title', 'release_year']]
right_df = movies[movies['title'].str.contains('Rings')][['title', 'rating']].reset_index(drop=True)
left_df

                                               title  release_year
0                           The Shawshank Redemption          1994
1                                      The Godfather          1972
2                                    The Dark Knight          2008
3                              The Godfather Part II          1974
4                                       12 Angry Men          1957
5                                   Schindler's List          1993
6      The Lord of the Rings: The Return of the King          2003
7                                       Pulp Fiction          1994
8  The Lord of the Rings: The Fellowship of the Ring          2001
9                     The Good, the Bad and the Ugly          1966

In [40]:
right_df

                                               title  rating
0      The Lord of the Rings: The Return of the King     9.0
1  The Lord of the Rings: The Fellowship of the Ring     8.8
2              The Lord of the Rings: The Two Towers     8.8

## Using `merge` function to join dataframes on columns

In [41]:
# default: inner join
pd.merge(left_df, right_df)

                                               title  release_year  rating
0      The Lord of the Rings: The Return of the King          2003     9.0
1  The Lord of the Rings: The Fellowship of the Ring          2001     8.8

In [42]:
# left join
pd.merge(left_df, right_df, how='left')

                                               title  release_year  rating
0                           The Shawshank Redemption          1994     NaN
1                                      The Godfather          1972     NaN
2                                    The Dark Knight          2008     NaN
3                              The Godfather Part II          1974     NaN
4                                       12 Angry Men          1957     NaN
5                                   Schindler's List          1993     NaN
6      The Lord of the Rings: The Return of the King          2003     9.0
7                                       Pulp Fiction          1994     NaN
8  The Lord of the Rings: The Fellowship of the Ring          2001     8.8
9                     The Good, the Bad and the Ugly          1966     NaN

In [43]:
# right join
pd.merge(left_df, right_df, how='right')

                                               title  release_year  rating
0      The Lord of the Rings: The Return of the King        2003.0     9.0
1  The Lord of the Rings: The Fellowship of the Ring        2001.0     8.8
2              The Lord of the Rings: The Two Towers           NaN     8.8

## Using `join` method to join dataframes on index

In [44]:
# join dataframes on index
left_df.join(right_df, lsuffix='_x', rsuffix='_y')

,title_x,release_year,title_y,rating
0,The Shawshank Redemption,1994,The Lord of the Rings: The Return of the King,9.0
1,The Godfather,1972,The Lord of the Rings: The Fellowship of the Ring,8.8
2,The Dark Knight,2008,The Lord of the Rings: The Two Towers,8.8
3,The Godfather Part II,1974,NaN,NaN
4,12 Angry Men,1957,NaN,NaN
5,Schindler's List,1993,NaN,NaN
6,The Lord of the Rings: The Return of the King,2003,NaN,NaN
7,Pulp Fiction,1994,NaN,NaN
8,The Lord of the Rings: The Fellowship of the Ring,2001,NaN,NaN
9,"The Good, the Bad and the Ugly",1966,NaN,NaN

In [45]:
left_df = left_df.set_index('title')
right_df = right_df.set_index('title')
# default: left join
left_df.join(right_df)

                                                   release_year  rating
title
The Shawshank Redemption                                   1994     NaN
The Godfather                                              1972     NaN
The Dark Knight                                            2008     NaN
The Godfather Part II                                      1974     NaN
12 Angry Men                                               1957     NaN
Schindler's List                                           1993     NaN
The Lord of the Rings: The Return of the King              2003     9.0
Pulp Fiction                                               1994     NaN
The Lord of the Rings: The Fellowship of the Ring          2001     8.8
The Good, the Bad and the Ugly                             1966     NaN

In [46]:
# inner join
left_df.join(right_df, how='inner')

                                                   release_year  rating
title
The Lord of the Rings: The Return of the King              2003     9.0
The Lord of the Rings: The Fellowship of the Ring          2001     8.8

In [47]:
# right join
left_df.join(right_df, how='right')

                                                   release_year  rating
title
The Lord of the Rings: The Return of the King            2003.0     9.0
The Lord of the Rings: The Fellowship of the Ring        2001.0     8.8
The Lord of the Rings: The Two Towers                       NaN     8.8